Repository: WynnChen/MDN-doc-zh_CN
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Page tags
zh_cn: 页面标签(tag)

source: Page titles
zh_cn: 页面标题

source: Page titles and section headings should use sentence-style capitalization (only capitalize the first word and proper nouns) rather than headline-style capitalization:
zh_cn: 页面标题与章节标题应当使用一般句子的大小写方式（只有句首单词和专有名词的首字母大写），而非新闻标题式的大小写方式：

source: Page titles are used in search results and also used to structure the page hierarchy in the breadcrumb list at the top of the page.
zh_cn: 在搜索结果中用到页面标题，在页面顶部展现页面层级结构的面包屑到行列中也用到页面标题。

source: Page titles, on the other hand, may be as long as you like, within reason, and they should be descriptive.
zh_cn: 另一方面，页面标题，在合理范围内，长度随意，且应当是描述性的。

source: Pages with this tag are deleted from time to time.
zh_cn: 具有此标签的页面会时不时被删除。

source: Please do not use variant spellings (e.g., use color rather than colour).
zh_cn: 请勿使用变体拼写法（例如，要用 color 而非 colour）。

source: Please.
zh_cn: 请别用。

source: Pluralization
zh_cn: 复数形式

source: Plurals of acronyms and abbreviations
zh_cn: 首字母缩略词与缩写的复数形式

source: Plurals of numerals
zh_cn: 数词的复数形式

source: Positioning child elements is thus much easier, and complex layouts can be achieved more simply and with cleaner code, as the display order of the elements is independent of their order in the source code.
zh_cn: 由于元素的显示顺序与它们在源代码中的顺序无关，定位子元素变得更容易，并且能够用更简单清晰的代码来完成复杂的布局。

source: Preferred dictionary
zh_cn: 首选字典

source: Preferred style guides
zh_cn: 首选样式指南

source: Press OK.
zh_cn: 按下确认。

source: Press enter (or return) to submit the new tag.
zh_cn: 按回车即可提交新标签。

source: Punctuation
zh_cn: 标点符号

source: Reference
zh_cn: 参考

source: Related topics
zh_cn: 相关主题

source: SEO summary
zh_cn: SEO 摘要

source: Screenshot of the "syntax highlighting" menu.
zh_cn: “语法高亮”菜单的屏幕截图

source: Screenshot of the UX for adding and removing tags on MDN
zh_cn: 在 MDN 上添加删除标签的用户交互的屏幕截图

source: Sections, paragraphs, and newlines
zh_cn: 章节、段落与换行

source: See the compatibility table on each property for up-to-date compatibility status.
zh_cn: 最新的兼容性状况可以查看每个具体属性的兼容性表格获取。

source: See {{anch("Creating a page link list")}} for guidelines.
zh_cn: 相关原则参见 {{anch("Creating a page link list")}}。

source: See {{anch("Writing a landing page overview")}} for tips.
zh_cn: 更多提示参见{{anch("Writing a landing page overview")}}。

source: Serial comma
zh_cn: 系列逗号

source: Similarly, the "Warning" style creates warning boxes like this.
zh_cn: 类似地，“警告”样式用于创建警告框，就像本条这样。

source: Similarly, the javascript: scheme is blocked by most modern browsers, as is jar:.
zh_cn: 同样，大部分现代浏览器也会阻止 javascript: 及 jar: scheme。

source: So for example, if you are talking about the actions of a specific man, usage of he/his would be fine, but if the subject is a person of either gender, he/his isn't appropriate.
zh_cn: 因此，举个例子说，如果谈论的是具体某位男性的行为，用 he/his 是可以的，但如果主题是任何性别的人，he/his 就不太恰当了。

source: Some examples follow:
zh_cn: 下面是一些例子：

source: Some of these are used so rarely that many readers won't understand the meaning, and others are often confused with one another.
zh_cn: 部分拉丁缩写很少使用，很多读者不明白其意思。其他的那些也常常会被互相混淆。

source: Specification
zh_cn: 规范

source: Specifications
zh_cn: 规范

source: Specificity
zh_cn: 特异性(specificity)

source: Spelling
zh_cn: 拼写

source: Status
zh_cn: 状态

source: Step-by-step tutorial about how to build layouts using this feature.
zh_cn: 循序渐进的讲解如何用此特性来建立布局。

source: Styling HTML element references
zh_cn: HTML 元素风格参考

source: Syntax highlighting
zh_cn: 语法高亮

source: Tabs and line breaks
zh_cn: 制表符与断行

source: Tagging obsolete pages
zh_cn: 标记过时页面

source: Tagging pages that need work
zh_cn: 标记需要进一步工作的页面

source: Tags provide meta information about a page and/or indicate that a page has specific improvements needed to its content.
zh_cn: 标签可以提供页面的有关元数据、表明页面的内容有具体需要改进之处。

source: Tags will autocomplete as you type.
zh_cn: 随着输入，标签会自动补全。

source: Terminology
zh_cn: 术语

source: Text formatting and styles
zh_cn: 文本格式与样式

source: That said, there is now good support across the board for flexbox.
zh_cn: 但，这么说吧，现在全线产品对弹性框都有良好支持。

source: The "Note" style is used to call out important notes, like this one.
zh_cn: “注解”样式用于表达重要的注解内容，就像本条这样。

source: The Enter (or Return) key on your keyboard starts a new paragraph.
zh_cn: 按回车键开启新段落。

source: The HyperText Mark-up Language
zh_cn: 超文本标记语言(HyperText Mark-up Language)

source: The SEO summary provides a short description of a page.
zh_cn: SEO 摘要提供页面的简短描述。

source: The best place to start in any extensive publishing style guide is with some very basic text standards to help keep documentation consistent.
zh_cn: 要制定任何大规模的出版物样式指南，都最好从一些用于帮助文档保持一致性的最基本文本标准开始。

source: The best solution, of course, is to rewrite and eliminate the pronouns:
zh_cn: 最佳解决方案，显然，是重写一下，消除代词：

source: The defining aspect of the flex layout is the ability to alter its items' width and/or height to best fill the available space on any display device.
zh_cn: 弹性布局在定义方面是指调整其内项目宽高从而在任何显示设备上实现对可用显示空间最佳填充的能力。

source: The following example shows text with JavaScript formatting:
zh_cn: 以下例子展示了按 Javascript 进行格式化后的文本：

source: The following sections outline some of these basics to help you.
zh_cn: 后继章节将概述这些基本原则。

source: The heading should use the class "Community".
zh_cn: 标题应当用"Community"类

source: The heading should use the class "Related_Topics".
zh_cn: 标题应当用"Related_Topics"类。

source: The heading should use the class "Tools".
zh_cn: 标题应当用"Tools"类。

source: The landing page should open with a paragraph or two describing the topic or technology, then provide a list of the subpages with descriptions of each page.
zh_cn: 着陆页开头应当是一两段对该主题或技术的描述，接下来是带有各个页面描述的子页面列表。

source: The language aspects of this guide apply primarily to English-language documentation.
zh_cn: 本指南中语言方面的内容主要针对英语文档。

source: The last way of dealing with the problem is arguably better, as it is not only grammatically more correct but removes some of the complexity associated with dealing with genders across different languages that may have wildly varying gender rules.
zh_cn: 处理这个问题，最后这种方式无疑更好一些，不仅在语法上更加正确，同时还省却了一些由不同语言间处理性别问题的差异所带来的复杂性。

source: The left column should be a list of articles, with an
zh_cn: 左栏应当是文章列表，顶部是

source: The left column should be a list of articles, with an header at the top of the left column explaining that it's a list of articles about the topic (for example "Documentation and tutorials about foo"); this header should use the CSS class "Documentation".
zh_cn: 左栏是文章列表，顶部有一个 标题，此标题说明了这是一个关于某主题的文章列表（例如“关于 foo 的文档与教程”）；这个标题应当用"Documentation" CSS 类。

source: The link list section of an MDN landing page consists of two columns.
zh_cn: MDN 着陆页的链接列表区段由两栏组成。

source: The page title (which is displayed at the top of the page and in the search results) can be different from the page "slug," which is the portion of the page's URL following "<locale&rt;/docs/".
zh_cn: 页面标题（显示于页面顶部和搜索结果中）可以与页面的“缩略名(slug)”不同。缩略名出现于URL中，即跟随在“<locale&rt;/docs/”后面的哪个部分。

source: The page title (which is displayed at the top of the page and in the search results) can be different from the page "slug," which is the portion of the page's URL following "<locale>/docs/".
zh_cn: 页面标题（显示于页面顶部和搜索结果中）可以与页面的“缩略名(slug)”不同。缩略名出现于URL中，即跟随在“<locale>/docs/”后面的那个部分。

source: The parentheses help differentiate methods from other code terms.
zh_cn: 括号可以帮助将方法与其他代码术语区分开来。

source: The right column should contain one or more of the following sections, in order:
zh_cn: 右栏应当包含以下区段中的一个或多个，按顺序分别是：

source: The serial (also known as "Oxford") comma is the comma that appears before the conjunction in a series of three or more items.
zh_cn: 系列逗号（又称“牛津逗号”）是指在三个或更多个项目并列结构中，出现在连词前的逗号。

source: The spelling checker for this site uses American English.
zh_cn: 此网站的拼写检查使用的是美式英语。

source: The stacking context
zh_cn: 堆叠的上下文

source: The tagging interface lives at the bottom of a page while you're in edit mode, and looks something like this:
zh_cn: 在编辑模式中，标签界面出现在页面底部，大致上看起来是这样：

source: The use of the third-person plural as a gender neutral pronoun (that is, using "they," them", "their," and "theirs") is an accepted practice, commonly known as "singular 'they.'"
zh_cn: 将第三人复数用作中性代词（即，用 "they," them", "their" 和 "theirs"）是种可接受的实践方法，通常称之为"singular 'they.'"

source: Then, with the text entry cursor inside the code box, select the appropriate language from the language list button to the right of the "pre" button, as seen in the screenshot to the right.
zh_cn: 然后，保持文本输入光标停留在代码框中，点击"pre"按钮右边的语言列表按钮，选择恰当的语言，如右边的屏幕截图所示。

source: There are specific rules to follow when writing about HTML elements.
zh_cn: 关于 HTML 元素，有一些具体规则需要遵守。

source: These are created using the following HTML:
zh_cn: 这是用以下 HTML 创建的：

source: These are guidelines rather than strict rules. We are more interested in content than formatting, so don't feel obligated to learn the style guide before contributing.
zh_cn: 这些内容只是指导原则而非强制规定。我们关注内容甚于格式，因此并不是非要先学好样式指南才能开始做贡献。

source: These rules produce consistent descriptions of elements and their components.
zh_cn: 这些规则为元素及其组件生成一致的描述。

source: These should be published as subpages of the localization team's page.
zh_cn: 它们应作为本地化团队页面的子页面发布。

source: These technologies will in theory eventually become obsolete and be removed, so you should stop using them.
zh_cn: 理论上说，这些技术最终都会变为过时并移除，因此应当停止使用它们。

source: They also ensure correct linking to detailed documentation.
zh_cn: 同时，也确保链接到正确的详细文档。

source: They have a standard format that consists of three areas:
zh_cn: 它们的标准格式由三个区域组成：

source: This independence intentionally affects only the visual rendering, leaving speech order and navigation based on the source order.
zh_cn: 这种无关性是特意限制于视觉呈现上的，语音顺序以及基于源代码顺序的导航均不受影响。

source: This is in contrast to the One Mozilla style guide, which specifies that the serial comma is not to be used.
zh_cn: 与之相反，一体化 Mozilla 样式指南明确指出不要使用系列逗号。

source: This results in:
zh_cn: 其结果是：

source: This should provide information on IRC channels and mailing lists available on the topic.
zh_cn: 这里要提供关于此主题可用的 IRC 频道和邮件列表信息。

source: This solution can make translation easier for both readers and localizers.
zh_cn: 这种解决方式使得无论是对读者还是对本地化人员而言，翻译都更加轻松。

source: Title and heading capitalization
zh_cn: 标题的大小写

source: To add a tag, click in the edit box at the end of the tag list and type the tag name you wish to add.
zh_cn: 要添加标签，点击位于标签列表末尾的编辑框并输入想要添加的标签名称。

source: To automatically create a link to a Bugzilla bug, use this macro:
zh_cn: 用这个宏自动建立通向某个 Bugzilla bug 的链接：

source: To fix this, use gender-neutral pronouns:
zh_cn: 要解决这个问题，使用中性代词：

source: To include an image:
zh_cn: 若要包含图像：

source: To insert a newline without a space, hold down the Shift key while pressing Enter.
zh_cn: 如果要另起一行又不想中间有空白，按住 Shift 键同时按回车。

source: To remove a tag, just click the little "X" icon in the tag.
zh_cn: 要移除标签，只要点击标签上小小的"X"图标即可。

source: Tools
zh_cn: 工具

source: Try to avoid putting your article at the top of the hierarchy, which slows the site down and makes search and site navigation less effective.
zh_cn: 避免将文章放在层级结构的顶层，这样会拖慢站点的速度，并且使搜索和站点导航的效果变差。

source: Try to be consistent, though.
zh_cn: 但是要尽力保持一致。

source: Tutorial explaining how to use flexbox in the specific context of Web applications.
zh_cn: 讲解在 Web 应用的特定环境下如何应用弹性框。

source: URL schemes
zh_cn: URL scheme（URL 方案）

source: Unless specifically instructed to do so, do not use the HTML style attribute to manually style content.
zh_cn: 除非有明确的指示，否则不要使用 HTML 的style 属性来手工指定内容样式。

source: Use "Code (inline)" style, and do not use quotation marks around strings, unless needed by the syntax of a code sample.
zh_cn: 用“代码（内联）”样式，同时，除非示例代码中的语法确实需要，字符串两边不要有引号。

source: Use "elements" to refer to HTML and XML elements, rather than "tags".
zh_cn: 用“元素”来指代 HTML 与 XML 元素，而非“标签”。

source: Use bold face.
zh_cn: 用粗体.

source: Use English-style plurals, not the Latin- or Greek-influenced forms.
zh_cn: 使用英语风格的复数，而不是拉丁式的或希腊文影响的形式。

source: Use full capitals and delete periods in all acronyms and abbreviations, including organizations such as "US" and "UN".
zh_cn: 首字母缩略词与缩写都要全大写并删除其中的句点，包括诸如"US"和"UN"这样的组织名称。

source: Use heading levels in decreasing order: {{HTMLElement("h2")}} then {{HTMLElement("h3")}} then {{HTMLElement("h4")}}, without skipping levels.
zh_cn: 按递减顺序使用各个标题级别：首先 {{HTMLElement("h2")}}，其次 {{HTMLElement("h3")}}，再次 {{HTMLElement("h4")}}，不要跳过级别。

source: Use labels like {{HTMLVersionInline(5)}} thoughtfully.
zh_cn: 使用诸如 {{HTMLVersionInline(5)}} 这样的标签时需要仔细考量。

source: Use periods in these abbreviations.
zh_cn: 在这些缩写中，要用句点（.）。

source: Use standard English capitalization rules in body text, and capitalize "World Wide Web" and "Web".
zh_cn: 在正文中，使用标准的英语大小写规则，同时首字母大写"World Wide Web"和"Web"。

source: Use the "Code" button (labeled with two angle brackets "<>") to apply inline code-style formatting to function names, variable names, and method names (this uses the {{HTMLElement("code")}} element).
zh_cn: 用“代码”按钮（标记是两个尖括号"<>"）来把内联代码样式应用到函数名、变量名、方法名上（这其实是用了{{HTMLElement("code")}} 元素）。

source: Use the "Formatting Styles" drop-down list to apply predefined styles to selected content.
zh_cn: 用“格式样式”下拉菜单可以把预定义的样式应用到选定内容上。

source: Use the following tags for pages that are not current:
zh_cn: 对于并非当前状态的页面，用以下标签：

source: Use the {{TemplateLink("HTMLElement")}} macro, which creates a link to the page for that element.
zh_cn: 用 {{TemplateLink("HTMLElement")}} 宏，这将建立通向此元素相应页面的链接。

source: Use the {{TemplateLink("htmlattrdef")}} macro (e.g., \{{htmlattrdef("type")}}) for the definition term, so that it can be linked to from other pages, then use the {{TemplateLink("htmlattrxref")}} macro (e.g., \{{htmlattrxref("attr","element")}}) to reference attribute definitions.
zh_cn: 对定义的术语用 {{TemplateLink("htmlattrdef")}} 宏（例如，\{{htmlattrdef("type")}}），这样它能够链接到其他网页，接着对参考属性定义用 {{TemplateLink("htmlattrxref")}} 宏（例如，\{{htmlattrxref("attr","element")}}）。

source: Use two spaces per tab in all code examples.
zh_cn: 在所有代码样本中，都按每个制表符两个空格的标准用空格缩进。

source: User interface actions
zh_cn: 用户界面操作

source: Using CSS flexible boxes
zh_cn: 使用 CSS 弹性框

source: Using flexbox to lay out Web applications
zh_cn: 用弹性框进行 Web 应用布局

source: Using, inserting images
zh_cn: 使用、插入图像

source: Voice
zh_cn: 语态

source: We have many older pages that were written before this style rule was established.
zh_cn: 有不少页面是在本样式规则确立之前编写的。

source: We will be expanding the guide over time, so if you have specific questions that aren't covered in this document, please send them to the MDC mailing list or project lead so we know what should be added.
zh_cn: 随着时间推移，我们会逐渐扩展此指南。所以如果你有任何此文档未包含的具体问题，请发给 MDC 邮件列表或项目负责人，好让我们知道应当添加哪些内容。

source: We're gradually getting to them.
zh_cn: 我们正在逐步处理。

source: When in doubt, expand it, or, better, link it to the article or glossary entry describing the technology.
zh_cn: 如果不确定，请将其展开，或者，更好的办法是，链接到描述此技术的文章或词汇表条目。

source: When you need to add some articles about a topic or subject area, you will typically do so by creating a landing page, then adding subpages for each of the individual articles.
zh_cn: 如果需要针对某个话题或主题领域添加若干文章，典型的做法是建立一个着陆页(landing page)，然后分别为每篇文章添加子页面。

source: While the active voice is preferred, the passive voice is also acceptable, given the informal feel of our content.
zh_cn: 首选主动语态，但用被动语态也可以，因为我们的内容有非正式的感觉。

source: Wiki markup and usage
zh_cn: wiki 标记与用法

source: You can also use the {{TemplateLink("obsolete_header")}} macro to put a prominent banner on the topic.
zh_cn: 还可以用 {{TemplateLink("obsolete_header")}} 宏来为主题放上一个突出的banner提示。

source: You can automate the insertion of pages into the list using some macros we've created.
zh_cn: 我们已经建好一些宏，通过它们可以自动将页面插入列表中。

source: You can find details on tagging in our How to properly tag pages guide.
zh_cn: 关于打标签的细节信息，参见如何正确为页面打标签指南。

source: You can use both genders:
zh_cn: 也可以同时使用两种性别：

source: and others
zh_cn: and others 以及其他

source: and so forth, and so on
zh_cn: and so forth, and so on 等等 / 及其他

source: block and a brief one-or-two sentence summary of the article in the corresponding
zh_cn: 块中，文章的一两句简短摘要则出现在相应的

source: block.
zh_cn: 块中。

source: compare
zh_cn: compare 对比

source: for example
zh_cn: for example 例如

source: header at the top of the left column explaining that it's a list of articles about the topic (for example "Documentation and tutorials about foo"); this header should use the CSS class "Documentation".
zh_cn: 标题，此标题说明了这是一个关于某主题的文章列表（例如“关于 foo 的文档与教程”）；这个标题应当用"Documentation" CSS 类。

source: inheritance
zh_cn: 继承(inheritance)

source: list of articles with each article's link in a
zh_cn: 列表，每篇文章的链接在

source: making the users plural:
zh_cn: 或者将用户也使用复数：

source: note well
zh_cn: note well 注意

source: postscript
zh_cn: postscript 附言 / 再者

source: that is, in other words
zh_cn: that is, in other words 换言之
